{
    "Overworld: Plains": "Flat, grassy areas, often where villages spawn.",
    "Overworld: Forest": "Contains a variety of trees; common biome.",
    "Overworld: Birch Forest": "Forests predominantly made up of birch trees.",
    "Overworld: Dark Forest": "Dense forest with dark oak trees and mushrooms.",
    "Overworld: Jungle": "Tropical biome with tall jungle trees, vines, and parrots.",
    "Overworld: Savanna": "Dry, grassy biome with acacia trees and occasional villages.",
    "Overworld: Desert": "Sandy biome with cacti, occasional villages, and desert temples.",
    "Overworld: Taiga": "Cold forest biome with spruce trees, wolves, and foxes.",
    "Overworld: Snowy Tundra": "Icy, snowy plains with igloos and occasional villages.",
    "Overworld: Mountains": "High-elevation biome with extreme terrain.",
    "Overworld: Swamp": "Marshy area with shallow water, lily pads, and witch huts.",
    "Overworld: Beach": "Sandy biome along the edges of oceans or rivers.",
    "Overworld: Badlands (Mesa)": "Colorful, eroded hills made of terracotta.",
    "Overworld: Mushroom Fields": "Rare biome with large mushrooms and Mooshrooms.",
    "Overworld: Ice Spikes": "Rare biome with tall ice structures.",
    "Overworld: Flower Forest": "Forest filled with a variety of flowers.",
    "Overworld: River": "Waterway cutting through various biomes.",
    "Overworld: Ocean": "Large bodies of water, sometimes with coral reefs and underwater structures.",
    "Overworld: Deep Ocean": "Deeper, darker ocean biome, occasionally with ocean monuments.",
    "Overworld: Lukewarm Ocean": "Warmer ocean biome with coral reefs.",
    "Overworld: Warm Ocean": "Clear water with abundant coral reefs.",
    "Overworld: Cold Ocean": "Colder ocean biome with kelp forests and icebergs.",
    "Overworld: Frozen Ocean": "Icy ocean with icebergs and frozen water.",
    "Overworld: Dripstone Caves": "Caves filled with dripstone and stalactites.",
    "Overworld: Lush Caves": "Underground caves with greenery, azalea, and glow berries.",
    "Overworld: Meadow": "Open grassy biome often surrounded by mountains.",
    "Overworld: Grove": "Snowy forest biome often found near mountains.",
    "Overworld: Snowy Slopes": "Snow-covered slopes of mountains.",
    "Overworld: Jagged Peaks": "High-elevation peaks with sharp, snowy ridges.",
    "Overworld: Frozen Peaks": "Snowy mountain peaks.",
    "Overworld: Stony Peaks": "Mountainous peaks with stony surfaces.",
    "Overworld: Village": "Settlements with various buildings and villagers.",
    "Overworld: Desert Temple": "Sandstone structure with hidden treasure and traps.",
    "Overworld: Jungle Temple": "Stone structure in jungles with traps and treasure.",
    "Overworld: Witch Hut": "Small huts in swamps with a witch and black cat.",
    "Overworld: Pillager Outpost": "Tower and tents with hostile pillagers.",
    "Overworld: Shipwreck": "Sunken ship structures with loot chests.",
    "Overworld: Ocean Monument": "Large underwater structures with guardians and treasure.",
    "Overworld: Igloo": "Snowy structure with a hidden basement and a brewing area.",
    "Overworld: Ruined Portal": "Broken Nether portals with a chest and obsidian blocks.",
    "Overworld: Stronghold": "Underground structure with the End Portal.",
    "Overworld: Mineshaft": "Underground tunnels with rails, loot, and cave spiders.",
    "Overworld: Dungeon": "Small room with a monster spawner and loot chests.",
    "Overworld: Woodland Mansion": "Large forest mansion with hostile mobs.",
    "Overworld: Buried Treasure": "Hidden chests found using treasure maps.",
    "Overworld: Ancient City": "Large structure found in the Deep Dark biome with the Warden.",
    "Overworld: Fossil": "Rare structures made of bone blocks, found underground or in deserts.",
    "Nether: Nether Wastes": "Classic Nether terrain with Netherrack and lava.",
    "Nether: Soul Sand Valley": "Sandy biome with soul sand and soul fire.",
    "Nether: Crimson Forest": "Nether forest with red, fungus-like trees and Hoglins.",
    "Nether: Warped Forest": "Nether forest with blue-green fungi and Endermen.",
    "Nether: Basalt Deltas": "Rocky biome with basalt pillars and lava pools.",
	"Nether: Nether Fortress": "Fortress structure with Blazes, Wither Skeletons, and loot.",
	"Nether: Bastion Remnant": "Ruined structure inhabited by Piglins with valuable loot.",
	"Nether: Ruined Portal": "Obsidian portal structures in the Nether.",
    "End: The End": "Main End biome with End Stone and the Ender Dragon.",
    "End: End Midlands": "Areas extending beyond the main island in the End.",
    "End: End Highlands": "Higher islands with Chorus plants.",
    "End: End Barrens": "Lower, barren parts of the outer End islands.",
    "End: Small End Islands": "Scattered islands in the End dimension.",
	"End: End City": "Tall structures on the outer End islands with valuable loot.",
	"End: End Ship": "Ships floating near End Cities, containing Elytra and treasure.",
    "Unique Environment: Deep Dark": "A dark, eerie cave biome with Sculk blocks and the Warden.",
    "Unique Environment: Coral Reef": "Colorful underwater biome found in warm oceans.",
    "Unique Environment: Giant Tree Taiga": "Taiga biome with tall spruce trees and podzol.",
    "Unique Environment: Bamboo Jungle": "Jungle variant with bamboo plants and pandas.",
    "Game Menu: Main Menu": "The starting screen when launching the game, with options like “Play,” “Settings,” and “Marketplace.”.",
    "Game Menu: World Selection Screen": "The screen where players can select, create, or delete worlds.",
    "Game Menu: Settings Menu": "The menu where players can adjust game settings, like graphics, sound, and controls.",
    "Game Menu: Multiplayer/Server Selection Screen": "The menu where players can join multiplayer servers or realms.",
    "Game Menu: Realms Menu": "The section dedicated to Minecraft Realms, allowing players to join, manage, or create private worlds.",
    "Game Menu: Marketplace (Bedrock Edition)": "The store where players can purchase skins, worlds, and texture packs.",
    "Game Menu: Pause Menu": "The in-game menu where players can access options like “Resume,” “Settings,” and “Quit to Title.”.",
    "Game Menu: Inventory Screen": "The player’s main interface for managing items, crafting, and equipping gear.",
    "Game Menu: Knapsack (Inventory)": "Also known as the player’s knapsack or backpack, where items, weapons, and tools are stored.",
    "Game Menu: Crafting Table Interface": "The expanded crafting menu used when interacting with a crafting table.",
    "Game Menu: Furnace Interface": "The menu for smelting ores or cooking food using a furnace.",
    "Game Menu: Anvil Interface": "The interface used to repair and rename items or apply enchantments using an anvil.",
    "Game Menu: Enchanting Table Interface": "The screen for enchanting items with various effects.",
    "Game Menu: Brewing Stand Interface": "The interface for brewing potions using a brewing stand.",
    "Game Menu: Villager Trading Screen": "The menu that appears when trading with villagers, showing available trades.",
    "Game Menu: Cartography Table Interface": "Used to create or clone maps and add map markers.",
    "Game Menu: Smithing Table Interface": "The screen for upgrading items to Netherite gear (Java and Bedrock Editions).",
    "Game Menu: Loom Interface": "The interface used to create banners and add patterns to them.",
    "Game Menu: Grindstone Interface": "Used to repair and disenchant items.",
    "Game Menu: Beacon Interface": "The interface for selecting status effects from a beacon.",
    "Game Menu: Chest Interface": "The screen that appears when interacting with a chest, allowing item storage and organization.",
    "Game Menu: Shulker Box Interface": "A portable chest interface that holds items even after being broken.",
    "Game Menu: Ender Chest Interface": "The personal storage chest interface shared across all Ender Chests in a world.",
    "Game Menu: Hopper Interface": "Used to transfer items between containers.",
    "Game Menu: Command Block Interface": "The interface used to program commands in command blocks.",
    "Game Menu: Spectator Mode HUD": "Minimalist display when in Spectator mode, allowing free movement through blocks.",
    "Game Menu: Debug Screen (Java Edition)": "The debug information display, showing coordinates, chunk info, and FPS.",
    "Game Menu: F3 Menu": "A menu that provides detailed game data, such as biome, block coordinates, and performance statistics (Java Edition).",
    "Game Menu: Death Screen": "The screen that appears upon player death, showing options to respawn or return to the main menu."
}


